{
    "stories": [
        {
            "id": "2823773174375142158",
            "title": "Amazon also slams Microsoft UK cloud practice following Google complaint",
            "url": "https://www.techradar.com/pro/amazon-also-slams-microsoft-uk-cloud-practice-following-google-complaint",
            "site": "techradar.com",
            "time": 1701855725000,
            "favicon_url": "https://static.tickertick.com/website_icons/techradar.com.ico",
            "tags": [
                "amzn"
            ],
            "description": "Amazon comments on Microsoft’s unfair business practices, even though it’s also under fire from the CMA. Amazon has become the latest in a growing number of companies and bodies criticizing Microsoft’s anticompetitive business practices in the UK.Google has already spoken out unfavorably about Microsoft following the company’s referral to the UK Competition and Markets Authority by Britain’s media regulator, Ofcom.An investigation is already underway into the country’s cloud computing industry after the CMA got involved in October. Microsoft criticized for cloud dominance, again Amazon’s comment comes as something of a surprise, given that Ofcom highlighted both Microsoft and Amazon’s dominance in the sector.In a statement to the CMA, Amazon commented: “To use many of Microsoft’s software products with these other cloud services providers, a customer must purchase a separate license even if they already own the software.”Microsoft announced changes to some of its terms earlier this year, which it said was to “help these partners to be more competitive and grow their businesses.” They came into effect on October 1, days before the CMA confirmed its investigation.Amazon’s statement also tackles that the company has been criticized for unfair business practices: “The cloud, and AWS in particular, has made switching between IT providers easier than ever before, which encourages vigorous competition to provide high-quality, innovative IT services at low cost.”The company said: “AWS looks forward to engaging cooperatively with the CMA during its investigation.”Conversely, Redmond’s statement was less optimistic, though the company did agree to engage with the CMA: “Microsoft considers there to be significant complexity involved in designing, monitoring and enforcing remedies which are effective, proportionate, and do not place an undue burden on cloud providers and, more importantly, their UK customers.”More broadly, Oracle also commented on the investigation, as well as cloud customers like Vodafone and trade associations like CISPE.TechRadar Pro has offered Microsoft and Amazon the opportunity to share their comments with us on the matter. Neither immediately responded. More from TechRadar Pro Amazon launches new cloud specifically for EuropeLooking for an alternative? Check out the best cloud hosting providersWant to store your data off-prem? Here are the best cloud storage and best cloud backup tools",
            "tickers": [
                "amzn"
            ],
            "img" : "https://cdn.mos.cms.futurecdn.net/rSTmCmeoaSTmeNWWL8GZ8T-970-80.jpg.webp"
        },
        {
            "id": "2374941649449559306",
            "title": "Twitch shutting down in South Korea next year; competitor AfreecaTV gaining momentum",
            "url": "https://mspoweruser.com/twitch-shutting-down-south-korea-alternatives/",
            "site": "mspoweruser.com",
            "time": 1701855392000,
            "favicon_url": "https://static.tickertick.com/website_icons/mspoweruser.com.ico",
            "tags": [
                "amzn"
            ],
            "description": "Popular live streaming app Twitch is shutting down its operation in South Korea, citing the extensive operational cost of the app as the main reason. The shutdown will be effective starting February 27, 2024. Twitch boss Dan Clancy says in the official announcement that the network fees to operate Twitch are ten times higher than […] Read More: Twitch shutting down in South Korea next year; competitor AfreecaTV gaining momentum",
            "tickers": [
                "amzn"
            ]
            
        },
        {
            "id": "-505435761035629676",
            "title": "Jeff Stelling's TV return: Sky Sports exit, change of heart and Amazon Prime comeback",
            "url": "https://www.mirror.co.uk/sport/football/jeff-stelling-sky-exit-amazon-31607542",
            "site": "mirror.co.uk",
            "time": 1701853904000,
            "favicon_url": "https://static.tickertick.com/website_icons/mirror.co.uk.ico",
            "tags": [
                "amzn"
            ],
            "description": "Jeff Stelling will return to TV screens in the UK just a few months after presenting Soccer Saturday for the final time, taking a role with Amazon for their Premier League coverage",
            "tickers": [
                "amzn"
            ],
            "img" : "https://i2-prod.dailystar.co.uk/incoming/article31557072.ece/ALTERNATES/s615/3_Everton-FC-v-Manchester-United-Premier-League.jpg"
        },
        {
            "id": "7834223119845141515",
            "title": "Twitch to cease operations in South Korea next year",
            "url": "https://www.gamesindustry.biz/twitch-ceasing-operations-in-south-korea-next-year",
            "site": "gamesindustry.biz",
            "time": 1701853175000,
            "favicon_url": "https://static.tickertick.com/website_icons/gamesindustry.biz.ico",
            "tags": [
                "amzn"
            ],
            "description": "Twitch is planning to shut down its streaming platform in South Korea next year. In a blog post shared on Tuesday, CEO Dan Clancy announced that Twitch would close in the country on February 27, 2024, due to high operating costs. Clancy shared that the company tried various tactics to reduce costs, such as adjusting source quality to 720p. Read more",
            "tickers": [
                "amzn"
            ],
            "img" : "https://assetsio.reedpopcdn.com/Twitch-00.png?width=720&quality=70&format=jpg&auto=webp"
        },
        {
            "id": "-4751747673984175150",
            "title": "Twitch is ending service in South Korea in February",
            "url": "https://www.videogameschronicle.com/news/twitch-is-ending-service-in-south-korea-in-february/",
            "site": "videogameschronicle.com",
            "time": 1701853162000,
            "favicon_url": "https://static.tickertick.com/website_icons/videogameschronicle.com.ico",
            "tags": [
                "amzn"
            ],
            "description": "Twitch's CEO has blamed network fees \"10 times higher\" than in other regions Twitch's CEO has blamed network fees \"10 times higher\" Source",
            "tickers": [
                "amzn"
            ],
            "img" : "https://th.bing.com/th/id/OIP.RKFBJ4SLx8lzYuIEzoEh4wHaEK?w=330&h=185&c=7&r=0&o=5&dpr=1.4&pid=1.7"
        },
        {
            "id": "-6630311698925949659",
            "title": "My Oodie alternative from Amazon is a godsend on cold days - and it was less than £30",
            "url": "https://www.mirror.co.uk/money/shopping-deals/oodie-alternative-amazon-godsend-cold-31603491",
            "site": "mirror.co.uk",
            "time": 1701852074000,
            "favicon_url": "https://static.tickertick.com/website_icons/mirror.co.uk.ico",
            "tags": [
                "amzn"
            ],
            "description": "With the temptation to putting our heating on, fashion and beauty writer Eve Rowlands shares why this Amazon alternative to the viral Oodie is just as good",
            "tickers": [
                "amzn"
            ]
        },
        
        {
            "id": "8854545475993552926",
            "title": "Can I get a decent rate on a car with my credit score?",
            "url": "https://www.reddit.com/r/personalfinance/comments/18bzb3n/can_i_get_a_decent_rate_on_a_car_with_my_credit/",
            "site": "reddit.com",
            "time": 1701850306000,
            "favicon_url": "https://static.tickertick.com/website_icons/reddit.com.ico",
            "tags": [
                "amzn"
            ],
            "description": "I need to get a car at the moment. Im 19 and my credit score just hit 712, I opened my 3rd card a few months ago (I have a capital one entry level card, the amazon prime card, and now an Apple Card) However my credit age is only 9- 10 months. I only have a 13% credit use but a 100% payment history. Im worried I'll get stuck with a high apr on a car loan, what has been yall's experiences? ​ btw wanted to add I make around 40k gross per year submitted by /u/lastomniverse [link] [comments] I need to get a car at the moment. Im 19 and my credit score just hit 712, I opened my 3rd card a few months ago (I have a capital one entry level card, the amazon prime card, and now an Apple Card) However my credit age is only 9- 10 months. I only have a 13% credit use but a 100% payment history. Im worried I'll get stuck with a high apr on a car loan, what has been yall's experiences? ​ btw wanted to add I make around 40k gross per year submitted by /u/lastomniverse [link] [comments]",
            "tickers": [
                "amzn"
            ],
            "img" : "https://th.bing.com/th?id=OIP.WdkGwTQdHXUTXP2tcQQDPwHaEc&w=200&h=119&rs=1&qlt=80&o=6&dpr=1.4&pid=3.1"
        }
    ],
    "last_id": "8854545475993552926"
}