{
    "stories": [
        {
            "id": "-302951180908201235",
            "title": "Musk’s xAI to raise $1bn in equity funding",
            "url": "https://www.verdict.co.uk/xai-to-raise-1bn/",
            "site": "verdict.co.uk",
            "time": 1701853411000,
            "favicon_url": "https://static.tickertick.com/website_icons/verdict.co.uk.ico",
            "tags": [
                "tsla"
            ],
            "description": "The AI company has already raised $134.67m from undisclosed investors. The post Musk’s xAI to raise $1bn in equity funding appeared first on Verdict. xAI, an artificial intelligence (AI) startup founded by Elon Musk, is looking to raise $1bn in equity funding. According to a filing to the US SEC, the AI company has already raised $134.67m from the total offering amount of $1bn. xAI has “entered into a binding and enforceable agreement for the purchase and sale of the” remaining shares. Musk incorporated the AI company in the US state of Nevada in March this year. Last month, the startup launched its first product, an AI chatbot, called Grok. Announcing the chatbot, xAI said Grok was developed in two months, and it is “still a very early beta product”. xAI claims that Grok was trained from the data posted on X and as a result offers quicker access to real-time developments. Grok is available to a limited number of users in the US for testing. After it exits testing, the AI assistant will be available as a part of X’s $16 monthly premium+ subscription. In a tweet last month, Musk said “X Corp investors will own 25% of xAI”. Despite his involvement in the field, Musk has shown serious skepticism towards AI. Musk signed an open letter on 22 March 2023, along with hundreds of other prominent figures in the business, advising prudence in the development of AI consumer products such as Open AI’s ChaptGPT. Musk co-founded OpenAI in 2015, but in 2018 left the company’s board. “OpenAI was created as an open source (which is why I named it “Open” AI), non-profit company to serve as a counterweight to Google, but now it has become a closed source, maximum-profit company effectively controlled by Microsoft. Not what I intended at all,” Musk said in the post on X, earlier this year. Microsoft has invested billions in OpenAI and recently joined its board as an observational non-voting member following the failed ousting of OpenAI CEO Sam Altman. The post Musk’s xAI to raise $1bn in equity funding appeared first on Verdict.",
            "tickers": [
                "tsla"
            ],
            "img" : "https://www.verdict.co.uk/wp-content/uploads/2023/12/shutterstock_2331020583.jpg"
        },
        {
            "id": "-4465745515223787013",
            "title": "Just in: Tesla sales decrease by 54% in Germany in Nov 22 vs Nov 23 comparison",
            "url": "https://www.reddit.com/r/wallstreetbets/comments/18bzzgq/just_in_tesla_sales_decrease_by_54_in_germany_in/",
            "site": "reddit.com",
            "time": 1701853405000,
            "favicon_url": "https://static.tickertick.com/website_icons/reddit.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "",
            "tickers": [
                "tsla"
            ]
        },
        {
            "id": "-8561781431056627587",
            "title": "Elon Musk’s xAI is looking for $1bn in equity offering",
            "url": "https://www.siliconrepublic.com/business/xai-elon-musk-equity-offering-ai-grok-chatgpt",
            "site": "siliconrepublic.com",
            "time": 1701851382000,
            "favicon_url": "https://static.tickertick.com/website_icons/siliconrepublic.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "A recent SEC filing suggests xAI already has an agreement to secure $1bn, as it continues work on its Grok chatbot to enter the generative AI market. Read more: Elon Musk’s xAI is looking for $1bn in equity offering",
            "tickers": [
                "tsla"
            ],
            "img" : "https://www.siliconrepublic.com/wp-content/uploads/2023/12/34329725835_697b6b1ec3_o-718x523.jpg"
        },
        {
            "id": "-6725247544150930881",
            "title": "Moody's outlook cut complicates Beijing's 'war' against market bears - Reuters",
            "url": "https://news.google.com/atom/articles/CBMicGh0dHBzOi8vd3d3LnJldXRlcnMuY29tL3dvcmxkL2NoaW5hL21vb2R5cy1vdXRsb29rLWN1dC1jb21wbGljYXRlcy1iZWlqaW5ncy13YXItYWdhaW5zdC1tYXJrZXQtYmVhcnMtMjAyMy0xMi0wNi_SAQA?oc=5",
            "site": "google.com",
            "time": 1701850620000,
            "favicon_url": "https://static.tickertick.com/website_icons/google.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Moody's outlook cut complicates Beijing's 'war' against market bears ReutersChina's Rising Debt Spurs Moody's to Lower Credit Outlook The New York TimesChina's credit rating downgraded, here's what it means for Tesla, Apple, Nike, LVMH Yahoo FinanceChina's battered economy suffers another blow as Moody's slashes its credit outlook Yahoo FinanceMoody’s warns it may downgrade China CNN Moody's outlook cut complicates Beijing's 'war' against market bears ReutersChina's Rising Debt Spurs Moody's to Lower Credit Outlook The New York TimesChina's credit rating downgraded, here's what it means for Tesla, Apple, Nike, LVMH Yahoo FinanceChina's battered economy suffers another blow as Moody's slashes its credit outlook Yahoo FinanceMoody’s warns it may downgrade China CNN",
            "tickers": [
                "tsla"
            ],
            "img": "https://th.bing.com/th?id=OVFT.Go0sWi22gpP4fChSDgPsMC&pid=News&w=300&h=186&c=14&rs=2&qlt=90&dpr=1.4"
        },
        {
            "id": "-2323799466816722373",
            "title": "Elon Musk’s AI startup seeks to raise $1bn; travel company Tui considers leaving London’s FTSE – business live",
            "url": "https://www.theguardian.com/business/live/2023/dec/06/elon-musks-x-ai-1bn-dollars-tui-londons-ftse-bank-of-england-andrew-bailey-financial-stability-business-live",
            "site": "theguardian.com",
            "time": 1701850617000,
            "favicon_url": "https://static.tickertick.com/website_icons/theguardian.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Live, rolling coverage of business, economics and financial markets as xAI reveals it has already raised $135mIn London the FTSE 100 benchmark index has gained 0.3% in the first few minutes of trading, in line with other indices across Europe.Here are the opening snaps from Reuters:EUROPE’S STOXX 600 UP 0.2%FRANCE’S CAC 40 UP 0.2%, SPAIN’S IBEX UP 0.3%EURO STOXX INDEX UP 0.2%; EURO ZONE BLUE CHIPS UP 0.2%GERMANY’S DAX UP 0.2% Continue reading...",
            "tickers": [
                "tsla"
            ],
            "img": "https://i.guim.co.uk/img/media/4f267694c963d78ebcd555f98cc5bb71911010e2/1032_107_1782_1069/master/1782.jpg?width=465&dpr=1&s=none"
        },
        {
            "id": "6004112174239993017",
            "title": "Elon Musk’s AI startup seeks to raise $1bn in equity",
            "url": "https://www.theguardian.com/technology/2023/dec/06/elon-musk-xai-startup-seeks-to-raise-1bn-in-equity",
            "site": "theguardian.com",
            "time": 1701849523000,
            "favicon_url": "https://static.tickertick.com/website_icons/theguardian.com.ico",
            "tags": [
                "tsla"
            ],
            "similar_stories": [
                "-8561781431056627587"
            ],
            "description": "Billionaire wants xAI to keep pace with rivals including OpenAI, Microsoft and GoogleElon Musk’s artificial intelligence startup xAI is looking to raise $1bn (£0.8bn) as the world’s richest man looks to keep pace with rivals including OpenAI, Microsoft and Google in the race to dominate the field.The company has already raised $135m from investors and is seeking a total of $1bn in equity financing according to a filing with the US Securities and Exchange Commission. Continue reading...",
            "tickers": [
                "tsla"
            ]
        },
        {
            "id": "6747825351569071853",
            "title": "CNBC Daily Open: Buzz words of the day — tech, AI, crypto",
            "url": "https://www.cnbc.com/2023/12/06/cnbc-daily-open-buzz-words-of-the-day-tech-ai-crypto.html",
            "site": "cnbc.com",
            "time": 1701847801000,
            "favicon_url": "https://static.tickertick.com/website_icons/cnbc.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "December isn't shaping up to be as slow as it ordinarily is. Apple remains on top and Elon Musk is now raising fresh capital for his AI startup.",
            "tickers": [
                "tsla"
            ],
            "img": "https://image.cnbcfm.com/api/v1/image/107302666-1695076812641-iphone_15_pros.jpg?v=1695128401&w=740&h=416&ffmt=webp&vtcrop=y"
        },
        {
            "id": "1916735448420324128",
            "title": "'We Need To Talk,' Responds Javier Milei After Elon Musk Shares Video Which Features President-Elect Critiquing Equality, Social Justice",
            "url": "https://www.benzinga.com/news/23/12/36106860/we-need-to-talk-responds-javier-milei-after-elon-musk-shares-video-which-features-president-elect-cr",
            "site": "benzinga.com",
            "time": 1701846190000,
            "favicon_url": "https://static.tickertick.com/website_icons/benzinga.com.ico",
            "tags": [
                "tsla"
            ],
            "description": "Just weeks after getting embroiled into a controversy for sharing an antisemitic post, Elon Musk's X profile has once again come under scrutiny after he shattered a video of Argentina's President-elect Javier Milei's bold critique of social justice. What Happened: On Tuesday, Musk took his social media platform X (formerly Twitter) and shared a clip of an interview of the Argentinian President Milei with political commentator Jorge Asís with his more than 165 million followers. The clip was created by Milei Explains, an account which shares clips of Milei's interviews and speeches with added English subtitles. See Also: Elon Musk’s xAI Startup Aims To Secure $1B In Equity Funding In the video, Milei can be heard quoting influential economists like Milton Friedman and John Stuart ...Full story available on Benzinga.com",
            "tickers": [
                "tsla"
            ]
        }
    ],
    "last_id": "1916735448420324128"
}